Revit 2026 API

# ReinforcementRoundingManagerIsActiveOnElement Property

---

Defines whether reinforcement rounding is activated for the particular element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsActiveOnElement { get; set; }
```
```vb
Public Property IsActiveOnElement As Boolean
	Get
	Set
```
```cpp
public:
property bool IsActiveOnElement {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsActiveOnElement : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: Reinforcement rounding overrides for this element cannot be enabled because overrides are not enabled for ReinforcementSettings. |

If these overrides relate to ReinforcementSettings, this property is shared for Rebar and Fabric related elements. Toggling this value will toggle the settings for both kinds of Reinforcement elements.

#### Reference

ReinforcementRoundingManager Class

Autodesk.Revit.DB.Structure Namespace